; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	infrared2 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(have_image Phenomenon6 thermograph0)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 infrared2)
	(have_image Planet9 thermograph0)
	(have_image Planet10 infrared2)
	(have_image Phenomenon11 infrared2)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 infrared2)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 thermograph0)
	(have_image Planet16 infrared2)
	(have_image Star17 image1)
	(have_image Star18 image1)
))

)

; plan
1. (turn_to satellite0 star0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star0)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 star18 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star18)
   goals met: 0 of 14
5. (take_image satellite0 star18 instrument0 image1)
   added: (have_image star18 image1)
   goals met: 1 of 14
6. (turn_to satellite0 star17 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star17)
   goals met: 1 of 14
7. (take_image satellite0 star17 instrument0 image1)
   added: (have_image star17 image1)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon11 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon11 instrument0 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 3 of 14
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 14
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 14
12. (turn_to satellite0 star2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star2)
   goals met: 3 of 14
13. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 3 of 14
14. (turn_to satellite0 phenomenon14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 14
15. (take_image satellite0 phenomenon14 instrument1 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 4 of 14
16. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 14
17. (take_image satellite0 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 5 of 14
18. (turn_to satellite0 phenomenon6 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 14
19. (take_image satellite0 phenomenon6 instrument1 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 6 of 14
20. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 14
21. (take_image satellite0 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 7 of 14
22. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 7 of 14
23. (take_image satellite0 planet10 instrument1 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 8 of 14
24. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 8 of 14
25. (take_image satellite0 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 9 of 14
26. (turn_to satellite0 planet16 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet16)
   goals met: 9 of 14
27. (take_image satellite0 planet16 instrument1 infrared2)
   added: (have_image planet16 infrared2)
   goals met: 10 of 14
28. (turn_to satellite0 planet7 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet7)
   goals met: 10 of 14
29. (take_image satellite0 planet7 instrument1 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 11 of 14
30. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 11 of 14
31. (take_image satellite0 planet9 instrument1 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 12 of 14
32. (turn_to satellite0 phenomenon13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon13)
   goals met: 13 of 14
33. (take_image satellite0 phenomenon13 instrument1 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 14 of 14
